BitNibble/Source_Library/stm32f411lib/Library/Src/stm32fxxxusart.c
/******************************************************************************
	STM32 XXX USART
Author: Sergio Santos 
	<sergio.salazar.santos@gmail.com>
License: GNU General Public License
Hardware: STM32-XXX
Date: 19062023
Comment:
	
*******************************************************************************/
/*** File Library ***/
#include "stm32fxxxusart.h"
#include <math.h>

/*** File Variable ***/
static STM32FXXXUSART_SR stm32fxxx_usart1_sr;
static STM32FXXXUSART_BRR stm32fxxx_usart1_brr;
static STM32FXXXUSART_CR1 stm32fxxx_usart1_cr1;
static STM32FXXXUSART_CR2 stm32fxxx_usart1_cr2;
static STM32FXXXUSART_CR3 stm32fxxx_usart1_cr3;
static STM32FXXXUSART_GTPR stm32fxxx_usart1_gtpr;
static STM32FXXX_USART1 stm32fxxx_usart1;
static STM32FXXXUSART_SR stm32fxxx_usart2_sr;
static STM32FXXXUSART_BRR stm32fxxx_usart2_brr;
static STM32FXXXUSART_CR1 stm32fxxx_usart2_cr1;
static STM32FXXXUSART_CR2 stm32fxxx_usart2_cr2;
static STM32FXXXUSART_CR3 stm32fxxx_usart2_cr3;
static STM32FXXXUSART_GTPR stm32fxxx_usart2_gtpr;
static STM32FXXX_USART2 stm32fxxx_usart2;
static STM32FXXXUSART_SR stm32fxxx_usart3_sr;
static STM32FXXXUSART_BRR stm32fxxx_usart3_brr;
static STM32FXXXUSART_CR1 stm32fxxx_usart3_cr1;
static STM32FXXXUSART_CR2 stm32fxxx_usart3_cr2;
static STM32FXXXUSART_CR3 stm32fxxx_usart3_cr3;
static STM32FXXXUSART_GTPR stm32fxxx_usart3_gtpr;
static STM32FXXX_USART3 stm32fxxx_usart3;
static STM32FXXXUSART_SR stm32fxxx_uart4_sr;
static STM32FXXXUSART_BRR stm32fxxx_uart4_brr;
static STM32FXXXUSART_CR1 stm32fxxx_uart4_cr1;
static STM32FXXXUSART_CR2 stm32fxxx_uart4_cr2;
static STM32FXXXUSART_CR3 stm32fxxx_uart4_cr3;
static STM32FXXXUSART_GTPR stm32fxxx_uart4_gtpr;
static STM32FXXX_UART4 stm32fxxx_uart4;
static STM32FXXXUSART_SR stm32fxxx_uart5_sr;
static STM32FXXXUSART_BRR stm32fxxx_uart5_brr;
static STM32FXXXUSART_CR1 stm32fxxx_uart5_cr1;
static STM32FXXXUSART_CR2 stm32fxxx_uart5_cr2;
static STM32FXXXUSART_CR3 stm32fxxx_uart5_cr3;
static STM32FXXXUSART_GTPR stm32fxxx_uart5_gtpr;
static STM32FXXX_UART5 stm32fxxx_uart5;
static STM32FXXXUSART_SR stm32fxxx_usart6_sr;
static STM32FXXXUSART_BRR stm32fxxx_usart6_brr;
static STM32FXXXUSART_CR1 stm32fxxx_usart6_cr1;
static STM32FXXXUSART_CR2 stm32fxxx_usart6_cr2;
static STM32FXXXUSART_CR3 stm32fxxx_usart6_cr3;
static STM32FXXXUSART_GTPR stm32fxxx_usart6_gtpr;
static STM32FXXX_USART6 stm32fxxx_usart6;
/*** File Procedure & Function Header ***/
/******/
STM32FXXXUSART_SR* stm32fxxx_usart1_sr_inic(void);
STM32FXXXUSART_BRR* stm32fxxx_usart1_brr_inic(void);
STM32FXXXUSART_CR1* stm32fxxx_usart1_cr1_inic(void);
STM32FXXXUSART_CR2* stm32fxxx_usart1_cr2_inic(void);
STM32FXXXUSART_CR3* stm32fxxx_usart1_cr3_inic(void);
STM32FXXXUSART_GTPR* stm32fxxx_usart1_gtpr_inic(void);
STM32FXXXUSART_SR* stm32fxxx_usart2_sr_inic(void);
STM32FXXXUSART_BRR* stm32fxxx_usart2_brr_inic(void);
STM32FXXXUSART_CR1* stm32fxxx_usart2_cr1_inic(void);
STM32FXXXUSART_CR2* stm32fxxx_usart2_cr2_inic(void);
STM32FXXXUSART_CR3* stm32fxxx_usart2_cr3_inic(void);
STM32FXXXUSART_GTPR* stm32fxxx_usart2_gtpr_inic(void);
STM32FXXXUSART_SR* stm32fxxx_usart3_sr_inic(void);
STM32FXXXUSART_BRR* stm32fxxx_usart3_brr_inic(void);
STM32FXXXUSART_CR1* stm32fxxx_usart3_cr1_inic(void);
STM32FXXXUSART_CR2* stm32fxxx_usart3_cr2_inic(void);
STM32FXXXUSART_CR3* stm32fxxx_usart3_cr3_inic(void);
STM32FXXXUSART_GTPR* stm32fxxx_usart3_gtpr_inic(void);
STM32FXXXUSART_SR* stm32fxxx_uart4_sr_inic(void);
STM32FXXXUSART_BRR* stm32fxxx_uart4_brr_inic(void);
STM32FXXXUSART_CR1* stm32fxxx_uart4_cr1_inic(void);
STM32FXXXUSART_CR2* stm32fxxx_uart4_cr2_inic(void);
STM32FXXXUSART_CR3* stm32fxxx_uart4_cr3_inic(void);
STM32FXXXUSART_GTPR* stm32fxxx_uart4_gtpr_inic(void);
STM32FXXXUSART_SR* stm32fxxx_uart5_sr_inic(void);
STM32FXXXUSART_BRR* stm32fxxx_uart5_brr_inic(void);
STM32FXXXUSART_CR1* stm32fxxx_uart5_cr1_inic(void);
STM32FXXXUSART_CR2* stm32fxxx_uart5_cr2_inic(void);
STM32FXXXUSART_CR3* stm32fxxx_uart5_cr3_inic(void);
STM32FXXXUSART_GTPR* stm32fxxx_uart5_gtpr_inic(void);
STM32FXXXUSART_SR* stm32fxxx_usart6_sr_inic(void);
STM32FXXXUSART_BRR* stm32fxxx_usart6_brr_inic(void);
STM32FXXXUSART_CR1* stm32fxxx_usart6_cr1_inic(void);
STM32FXXXUSART_CR2* stm32fxxx_usart6_cr2_inic(void);
STM32FXXXUSART_CR3* stm32fxxx_usart6_cr3_inic(void);
STM32FXXXUSART_GTPR* stm32fxxx_usart6_gtpr_inic(void);
/*** USART Procedure & Function Definition ***/
/*** USART1 ***/
void STM32FXXXUsart1Clock( uint8_t bool )
{
	if(bool){ RCC->APB2ENR |= (1 << 4); }else{ RCC->APB2ENR &= ~(1 << 4); }
}
void STM32FXXXUsart1Nvic( uint8_t bool )
{
	if(bool){ setbit(NVIC->ISER, 1, USART1_IRQn, 1); }else{ setbit(NVIC->ICER, 1, USART1_IRQn, 1); }
}
void STM32FXXXUsart1Parameter( uint8_t wordlength, uint8_t samplingmode, double stopbits, uint32_t baudrate )
// Sets the usart parameters, using real values.
{
	uint8_t sampling;
	double value, fracpart, intpart;
	if(wordlength == 9)
		USART1->CR1 |= (1 << 12); // M: Word length, 1 - 9bit.
	else if(wordlength == 8)
		USART1->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit.
	else
		USART1->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit, default.

	if(samplingmode == 8){
		sampling = 8;
		USART1->CR1 |= (1 << 15); // OVER8: Oversampling mode, 1 - 8.
	}else if(samplingmode == 16){
		sampling = 16;
		USART1->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16.
	}else{
		sampling = 16;
		USART1->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16, default.
	}

	USART1->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12)); // STOP: STOP bits 00 - 1stopbit, default.
	if(fabs(stopbits - 0.5) < 0.00001) // STOP: STOP bits, 01: 0.5 Stop bit
		USART1->CR2 |= (1 << 12);
	else if(fabs(stopbits - 1) < 0.00001) // STOP: STOP bits, 00: 1 Stop bit.
		USART1->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 1.5) < 0.00001) // STOP: STOP bits, 11: 1.5 Stop bit
		USART1->CR2 |= ((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 2) < 0.00001) // STOP: STOP bits, 10: 2 Stop bits
		USART1->CR2 |= (1 << 13);

	value = (double) getsysclk() / ( gethpre() * sampling * baudrate );
	fracpart = modf(value, &intpart);
	USART1->BRR = 0; // clean slate, reset.
	if(samplingmode == 16){
		USART1->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		USART1->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else if(samplingmode == 8){
		USART1->BRR = (uint32_t) (round(fracpart * 8)); // DIV_Fraction
		USART1->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else{
		USART1->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		USART1->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0], default.
	}
}
/*** USART 1 Bit Mapping ***/
// SR
uint8_t STM32FXXXUsart1_cts(void)
{
	return readreg(USART1->SR, 1, 9);
}
void STM32FXXXUsart1_clear_cts(void)
{
	setreg(&USART1->SR, 1, 9, 0);
}
uint8_t STM32FXXXUsart1_lbd(void)
{
	return readreg(USART1->SR, 1, 8);
}
void STM32FXXXUsart1_clear_lbd(void)
{
	setreg(&USART1->SR, 1, 8, 0);
}
uint8_t STM32FXXXUsart1_txe(void)
{
	return readreg(USART1->SR, 1, 7);
}
uint8_t STM32FXXXUsart1_tc(void)
{
	return readreg(USART1->SR, 1, 6);
}
void STM32FXXXUsart1_clear_tc(void)
{
	setreg(&USART1->SR, 1, 6, 0);
}
uint8_t STM32FXXXUsart1_rxne(void)
{
	return readreg(USART1->SR, 1, 5);
}
void STM32FXXXUsart1_clear_rxne(void)
{
	setreg(&USART1->SR, 1, 5, 0);
}
uint8_t STM32FXXXUsart1_idle(void)
{
	return readreg(USART1->SR, 1, 4);
}
uint8_t STM32FXXXUsart1_ore(void)
{
	return readreg(USART1->SR, 1, 3);
}
uint8_t STM32FXXXUsart1_nf(void)
{
	return readreg(USART1->SR, 1, 2);
}
uint8_t STM32FXXXUsart1_fe(void)
{
	return readreg(USART1->SR, 1, 1);
}
uint8_t STM32FXXXUsart1_pe(void)
{
	return readreg(USART1->SR, 1, 0);
}
// DR
void STM32FXXXUsart1_dr(uint32_t data)
{
	writereg(&USART1->DR, 9, 0, data);
}
uint32_t STM32FXXXUsart1_get_dr(void)
{
	return readreg(USART1->DR, 9, 0);
}
// BRR
void STM32FXXXUsart1_div_mantissa(uint16_t value)
{
	setreg(&USART1->BRR, 12, 4, value);
}
void STM32FXXXUsart1_div_fraction(uint8_t value)
{
	setreg(&USART1->BRR, 4, 0, value);
}
// CR1
void STM32FXXXUsart1_over8(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 15, bool);
}
void STM32FXXXUsart1_ue(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 13, bool);
}
void STM32FXXXUsart1_m(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 12, bool);
}
void STM32FXXXUsart1_wake(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 11, bool);
}
void STM32FXXXUsart1_pce(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 10, bool);
}
void STM32FXXXUsart1_ps(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 9, bool);
}
void STM32FXXXUsart1_peie(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 8, bool);
}
void STM32FXXXUsart1_txeie(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 7, bool);
}
void STM32FXXXUsart1_tcie(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 6, bool);
}
void STM32FXXXUsart1_rxneie(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 5, bool);
}
void STM32FXXXUsart1_idleie(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 4, bool);
}
void STM32FXXXUsart1_te(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 3, bool);
}
void STM32FXXXUsart1_re(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 2, bool);
}
void STM32FXXXUsart1_rwu(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 1, bool);
}
void STM32FXXXUsart1_sbk(uint8_t bool)
{
	setreg(&USART1->CR1, 1, 0, bool);
}
// CR2
void STM32FXXXUsart1_linen(uint8_t bool)
{
	setreg(&USART1->CR2, 1, 14, bool);
}
void STM32FXXXUsart1_stop(uint8_t value)
{
	setreg(&USART1->CR2, 2, 12, value);
}

