BitNibble/Source_Library/stm32f411lib/Library/Src/stm32fxxxusart.c
void STM32FXXXUsart1_clken(uint8_t bool)
{
	setreg(&USART1->CR2, 1, 11, bool);
}
void STM32FXXXUsart1_cpol(uint8_t bool)
{
	setreg(&USART1->CR2, 1, 10, bool);
}
void STM32FXXXUsart1_cpha(uint8_t bool)
{
	setreg(&USART1->CR2, 1, 9, bool);
}
void STM32FXXXUsart1_lbcl(uint8_t bool)
{
	setreg(&USART1->CR2, 1, 8, bool);
}
void STM32FXXXUsart1_lbdie(uint8_t bool)
{
	setreg(&USART1->CR2, 1, 6, bool);
}
void STM32FXXXUsart1_lbdl(uint8_t bool)
{
	setreg(&USART1->CR2, 1, 5, bool);
}
void STM32FXXXUsart1_add(uint8_t value)
{
	setreg(&USART1->CR2, 4, 0, value);
}
// CR3
void STM32FXXXUsart1_onebit(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 11, bool);
}
void STM32FXXXUsart1_ctsie(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 10, bool);
}
void STM32FXXXUsart1_ctse(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 9, bool);
}
void STM32FXXXUsart1_rtse(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 8, bool);
}
void STM32FXXXUsart1_dmat(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 7, bool);
}
void STM32FXXXUsart1_dmar(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 6, bool);
}
void STM32FXXXUsart1_scen(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 5, bool);
}
void STM32FXXXUsart1_nack(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 4, bool);
}
void STM32FXXXUsart1_hdsel(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 3, bool);
}
void STM32FXXXUsart1_irlp(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 2, bool);
}
void STM32FXXXUsart1_iren(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 1, bool);
}
void STM32FXXXUsart1_eie(uint8_t bool)
{
	setreg(&USART1->CR3, 1, 0, bool);
}
// GTPR
void STM32FXXXUsart1_gt(uint8_t value)
{
	setreg(&USART1->GTPR, 8, 8, value);
}
void STM32FXXXUsart1_psc(uint8_t value)
{
	setreg(&USART1->GTPR, 8, 0, value);
}
/*** USART2 ***/
void STM32FXXXUsart2Clock( uint8_t bool )
{
	if(bool){ RCC->APB1ENR |= (1 << 17); }else{ RCC->APB1ENR &= ~(1 << 17); }
}
void STM32FXXXUsart2Nvic( uint8_t bool )
{
	if(bool){ setbit(NVIC->ISER, 1, USART2_IRQn, 1); }else{ setbit(NVIC->ICER, 1, USART2_IRQn, 1); }
}
void STM32FXXXUsart2Parameter( uint8_t wordlength, uint8_t samplingmode, double stopbits, uint32_t baudrate )
// Sets the usart parameters, using real values.
{
	uint8_t sampling;
	double value, fracpart, intpart;
	if(wordlength == 9)
		USART2->CR1 |= (1 << 12); // M: Word length, 1 - 9bit.
	else if(wordlength == 8)
		USART2->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit.
	else
		USART2->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit, default.
	if(samplingmode == 8){
		sampling = 8;
		USART2->CR1 |= (1 << 15); // OVER8: Oversampling mode, 1 - 8.
	}else if(samplingmode == 16){
		sampling = 16;
		USART2->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16.
	}else{
		sampling = 16;
		USART2->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16, default.
	}
	USART2->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12)); // STOP: STOP bits 00 - 1stopbit, default.
	if(fabs(stopbits - 0.5) < 0.00001) // STOP: STOP bits, 01: 0.5 Stop bit
		USART2->CR2 |= (1 << 12);
	else if(fabs(stopbits - 1) < 0.00001) // STOP: STOP bits, 00: 1 Stop bit.
		USART2->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 1.5) < 0.00001) // STOP: STOP bits, 11: 1.5 Stop bit
		USART2->CR2 |= ((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 2) < 0.00001) // STOP: STOP bits, 10: 2 Stop bits
		USART2->CR2 |= (1 << 13);
	value = (double) getsysclk() / ( gethpre() * sampling * baudrate );
	fracpart = modf(value, &intpart);
	USART2->BRR = 0; // clean slate, reset.
	if(samplingmode == 16){
		USART2->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		USART2->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else if(samplingmode == 8){
		USART2->BRR = (uint32_t) (round(fracpart * 8)); // DIV_Fraction
		USART2->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else{
		USART2->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		USART2->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0], default.
	}
}
/*** USART 2 Bit Mapping ***/
// SR
uint8_t STM32FXXXUsart2_cts(void)
{
	return readreg(USART2->SR, 1, 9);
}
void STM32FXXXUsart2_clear_cts(void)
{
	setreg(&USART2->SR, 1, 9, 0);
}
uint8_t STM32FXXXUsart2_lbd(void)
{
	return readreg(USART2->SR, 1, 8);
}
void STM32FXXXUsart2_clear_lbd(void)
{
	setreg(&USART2->SR, 1, 8, 0);
}
uint8_t STM32FXXXUsart2_txe(void)
{
	return readreg(USART2->SR, 1, 7);
}
uint8_t STM32FXXXUsart2_tc(void)
{
	return readreg(USART2->SR, 1, 6);
}
void STM32FXXXUsart2_clear_tc(void)
{
	setreg(&USART2->SR, 1, 6, 0);
}
uint8_t STM32FXXXUsart2_rxne(void)
{
	return readreg(USART2->SR, 1, 5);
}
void STM32FXXXUsart2_clear_rxne(void)
{
	setreg(&USART2->SR, 1, 5, 0);
}
uint8_t STM32FXXXUsart2_idle(void)
{
	return readreg(USART2->SR, 1, 4);
}
uint8_t STM32FXXXUsart2_ore(void)
{
	return readreg(USART2->SR, 1, 3);
}
uint8_t STM32FXXXUsart2_nf(void)
{
	return readreg(USART2->SR, 1, 2);
}
uint8_t STM32FXXXUsart2_fe(void)
{
	return readreg(USART2->SR, 1, 1);
}
uint8_t STM32FXXXUsart2_pe(void)
{
	return readreg(USART2->SR, 1, 0);
}
// DR
void STM32FXXXUsart2_dr(uint32_t data)
{
	writereg(&USART2->DR, 9, 0, data);
}
uint32_t STM32FXXXUsart2_get_dr(void)
{
	return readreg(USART2->DR, 9, 0);
}
// BRR
void STM32FXXXUsart2_div_mantissa(uint16_t value)
{
	setreg(&USART2->BRR, 12, 4, value);
}
void STM32FXXXUsart2_div_fraction(uint8_t value)
{
	setreg(&USART2->BRR, 4, 0, value);
}
// CR1
void STM32FXXXUsart2_over8(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 15, bool);
}
void STM32FXXXUsart2_ue(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 13, bool);
}
void STM32FXXXUsart2_m(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 12, bool);
}
void STM32FXXXUsart2_wake(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 11, bool);
}
void STM32FXXXUsart2_pce(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 10, bool);
}
void STM32FXXXUsart2_ps(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 9, bool);
}
void STM32FXXXUsart2_peie(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 8, bool);
}
void STM32FXXXUsart2_txeie(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 7, bool);
}
void STM32FXXXUsart2_tcie(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 6, bool);
}
void STM32FXXXUsart2_rxneie(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 5, bool);
}
void STM32FXXXUsart2_idleie(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 4, bool);
}
void STM32FXXXUsart2_te(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 3, bool);
}
void STM32FXXXUsart2_re(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 2, bool);
}
void STM32FXXXUsart2_rwu(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 1, bool);
}
void STM32FXXXUsart2_sbk(uint8_t bool)
{
	setreg(&USART2->CR1, 1, 0, bool);
}
// CR2
void STM32FXXXUsart2_linen(uint8_t bool)
{
	setreg(&USART2->CR2, 1, 14, bool);
}
void STM32FXXXUsart2_stop(uint8_t value)
{
	setreg(&USART2->CR2, 2, 12, value);
}
void STM32FXXXUsart2_clken(uint8_t bool)
{
	setreg(&USART2->CR2, 1, 11, bool);
}
void STM32FXXXUsart2_cpol(uint8_t bool)
{
	setreg(&USART2->CR2, 1, 10, bool);
}
void STM32FXXXUsart2_cpha(uint8_t bool)
{
	setreg(&USART2->CR2, 1, 9, bool);
}
void STM32FXXXUsart2_lbcl(uint8_t bool)
{
	setreg(&USART2->CR2, 1, 8, bool);
}
void STM32FXXXUsart2_lbdie(uint8_t bool)
{
	setreg(&USART2->CR2, 1, 6, bool);
}
void STM32FXXXUsart2_lbdl(uint8_t bool)
{
	setreg(&USART2->CR2, 1, 5, bool);
}
void STM32FXXXUsart2_add(uint8_t value)
{
	setreg(&USART2->CR2, 4, 0, value);
}
// CR3
void STM32FXXXUsart2_onebit(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 11, bool);
}
void STM32FXXXUsart2_ctsie(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 10, bool);
}
void STM32FXXXUsart2_ctse(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 9, bool);
}
void STM32FXXXUsart2_rtse(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 8, bool);
}
void STM32FXXXUsart2_dmat(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 7, bool);
}
void STM32FXXXUsart2_dmar(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 6, bool);
}
void STM32FXXXUsart2_scen(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 5, bool);
}
void STM32FXXXUsart2_nack(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 4, bool);
}
void STM32FXXXUsart2_hdsel(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 3, bool);
}
void STM32FXXXUsart2_irlp(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 2, bool);
}
void STM32FXXXUsart2_iren(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 1, bool);
}
void STM32FXXXUsart2_eie(uint8_t bool)
{
	setreg(&USART2->CR3, 1, 0, bool);
}
// GTPR
void STM32FXXXUsart2_gt(uint8_t value)
{
	setreg(&USART2->GTPR, 8, 8, value);
}
void STM32FXXXUsart2_psc(uint8_t value)
{
	setreg(&USART2->GTPR, 8, 0, value);
}
#ifdef STM32F446xx
/*** USART3 ***/
void STM32FXXXUsart3Clock( uint8_t bool )
{
	if(bool){ RCC->APB1ENR |= (1 << 18); }else{ RCC->APB1ENR &= ~(1 << 18); }
}
void STM32FXXXUsart3Nvic( uint8_t bool )
{
	if(bool){ setbit(NVIC->ISER, 1, USART3_IRQn, 1); }else{ setbit(NVIC->ICER, 1, USART3_IRQn, 1); }
}
void STM32FXXXUsart3Parameter( uint8_t wordlength, uint8_t samplingmode, double stopbits, uint32_t baudrate )
// Sets the usart parameters, using real values.
{
	uint8_t sampling;
	double value, fracpart, intpart;
	if(wordlength == 9)
		USART3->CR1 |= (1 << 12); // M: Word length, 1 - 9bit.
	else if(wordlength == 8)
		USART3->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit.
	else
		USART3->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit, default.
	if(samplingmode == 8){
		sampling = 8;
		USART3->CR1 |= (1 << 15); // OVER8: Oversampling mode, 1 - 8.
	}else if(samplingmode == 16){
		sampling = 16;
		USART3->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16.
	}else{
		sampling = 16;
		USART3->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16, default.
	}
	USART3->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12)); // STOP: STOP bits 00 - 1stopbit, default.
	if(fabs(stopbits - 0.5) < 0.00001) // STOP: STOP bits, 01: 0.5 Stop bit
		USART3->CR2 |= (1 << 12);
	else if(fabs(stopbits - 1) < 0.00001) // STOP: STOP bits, 00: 1 Stop bit.
		USART3->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 1.5) < 0.00001) // STOP: STOP bits, 11: 1.5 Stop bit
		USART3->CR2 |= ((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 2) < 0.00001) // STOP: STOP bits, 10: 2 Stop bits
		USART3->CR2 |= (1 << 13);
	value = (double) getsysclk() / ( gethpre() * sampling * baudrate );
	fracpart = modf(value, &intpart);
	USART3->BRR = 0; // clean slate, reset.
	if(samplingmode == 16){
		USART3->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		USART3->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else if(samplingmode == 8){
		USART3->BRR = (uint32_t) (round(fracpart * 8)); // DIV_Fraction
		USART3->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else{
		USART3->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		USART3->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0], default.
	}
}
/*** USART 3 Bit Mapping ***/
// SR
uint8_t STM32FXXXUsart3_cts(void)
{
	return readreg(USART3->SR, 1, 9);
}
void STM32FXXXUsart3_clear_cts(void)
{
	setreg(&USART3->SR, 1, 9, 0);
}
uint8_t STM32FXXXUsart3_lbd(void)
{
	return readreg(USART3->SR, 1, 8);
}
void STM32FXXXUsart3_clear_lbd(void)
{
	setreg(&USART3->SR, 1, 8, 0);
}
uint8_t STM32FXXXUsart3_txe(void)
{
	return readreg(USART3->SR, 1, 7);
}
uint8_t STM32FXXXUsart3_tc(void)
{
	return readreg(USART3->SR, 1, 6);
}
void STM32FXXXUsart3_clear_tc(void)
{
	setreg(&USART3->SR, 1, 6, 0);
}
uint8_t STM32FXXXUsart3_rxne(void)
{
	return readreg(USART3->SR, 1, 5);
}
void STM32FXXXUsart3_clear_rxne(void)
{
	setreg(&USART3->SR, 1, 5, 0);
}
uint8_t STM32FXXXUsart3_idle(void)
{
	return readreg(USART3->SR, 1, 4);
}
uint8_t STM32FXXXUsart3_ore(void)
{
	return readreg(USART3->SR, 1, 3);
}
uint8_t STM32FXXXUsart3_nf(void)
{
	return readreg(USART3->SR, 1, 2);
}
uint8_t STM32FXXXUsart3_fe(void)
{
	return readreg(USART3->SR, 1, 1);
}
uint8_t STM32FXXXUsart3_pe(void)
{
	return readreg(USART3->SR, 1, 0);
}
// DR
void STM32FXXXUsart3_dr(uint32_t data)
{
	writereg(&USART3->DR, 9, 0, data);
}
uint32_t STM32FXXXUsart3_get_dr(void)
{
	return readreg(USART3->DR, 9, 0);
}
// BRR
void STM32FXXXUsart3_div_mantissa(uint16_t value)
{
	setreg(&USART3->BRR, 12, 4, value);
}
void STM32FXXXUsart3_div_fraction(uint8_t value)
{
	setreg(&USART3->BRR, 4, 0, value);
}
// CR1
void STM32FXXXUsart3_over8(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 15, bool);
}
void STM32FXXXUsart3_ue(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 13, bool);
}
void STM32FXXXUsart3_m(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 12, bool);
}
void STM32FXXXUsart3_wake(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 11, bool);
}
void STM32FXXXUsart3_pce(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 10, bool);
}
void STM32FXXXUsart3_ps(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 9, bool);
}
void STM32FXXXUsart3_peie(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 8, bool);
}
void STM32FXXXUsart3_txeie(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 7, bool);
}
void STM32FXXXUsart3_tcie(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 6, bool);
}
void STM32FXXXUsart3_rxneie(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 5, bool);
}
void STM32FXXXUsart3_idleie(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 4, bool);
}
void STM32FXXXUsart3_te(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 3, bool);
}
void STM32FXXXUsart3_re(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 2, bool);
}
void STM32FXXXUsart3_rwu(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 1, bool);
}
void STM32FXXXUsart3_sbk(uint8_t bool)
{
	setreg(&USART3->CR1, 1, 0, bool);
}
// CR2
void STM32FXXXUsart3_linen(uint8_t bool)
{
	setreg(&USART3->CR2, 1, 14, bool);
}
void STM32FXXXUsart3_stop(uint8_t value)
{
	setreg(&USART3->CR2, 2, 12, value);
}
void STM32FXXXUsart3_clken(uint8_t bool)
{
	setreg(&USART3->CR2, 1, 11, bool);
}
void STM32FXXXUsart3_cpol(uint8_t bool)
{
	setreg(&USART3->CR2, 1, 10, bool);
}
void STM32FXXXUsart3_cpha(uint8_t bool)
{
	setreg(&USART3->CR2, 1, 9, bool);
}
void STM32FXXXUsart3_lbcl(uint8_t bool)
{
	setreg(&USART3->CR2, 1, 8, bool);
}
void STM32FXXXUsart3_lbdie(uint8_t bool)
{
	setreg(&USART3->CR2, 1, 6, bool);
}
void STM32FXXXUsart3_lbdl(uint8_t bool)
{
	setreg(&USART3->CR2, 1, 5, bool);
}
void STM32FXXXUsart3_add(uint8_t value)
{
	setreg(&USART3->CR2, 4, 0, value);
}
// CR3
void STM32FXXXUsart3_onebit(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 11, bool);
}
void STM32FXXXUsart3_ctsie(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 10, bool);
}
void STM32FXXXUsart3_ctse(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 9, bool);
}
void STM32FXXXUsart3_rtse(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 8, bool);
}
void STM32FXXXUsart3_dmat(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 7, bool);
}
void STM32FXXXUsart3_dmar(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 6, bool);
}
void STM32FXXXUsart3_scen(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 5, bool);
}
void STM32FXXXUsart3_nack(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 4, bool);
}
void STM32FXXXUsart3_hdsel(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 3, bool);
}
void STM32FXXXUsart3_irlp(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 2, bool);
}
void STM32FXXXUsart3_iren(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 1, bool);
}
void STM32FXXXUsart3_eie(uint8_t bool)
{
	setreg(&USART3->CR3, 1, 0, bool);
}
// GTPR
void STM32FXXXUsart3_gt(uint8_t value)
{
	setreg(&USART3->GTPR, 8, 8, value);
}
void STM32FXXXUsart3_psc(uint8_t value)
{
	setreg(&USART3->GTPR, 8, 0, value);
}
/*** UART4 ***/
void STM32FXXXUart4Clock( uint8_t bool )
{
	if(bool){ RCC->APB1ENR |= (1 << 19); }else{ RCC->APB1ENR &= ~(1 << 19); }

