BitNibble/Source_Library/stm32f411lib/Library/Src/stm32fxxxusart.c
	// CR2
	stm32fxxx_usart1_cr2.linen = STM32FXXXUsart1_linen;
	stm32fxxx_usart1_cr2.stop = STM32FXXXUsart1_stop;
	stm32fxxx_usart1_cr2.clken = STM32FXXXUsart1_clken;
	stm32fxxx_usart1_cr2.cpol = STM32FXXXUsart1_cpol;
	stm32fxxx_usart1_cr2.cpha = STM32FXXXUsart1_cpha;
	stm32fxxx_usart1_cr2.lbcl = STM32FXXXUsart1_lbcl;
	stm32fxxx_usart1_cr2.lbdie = STM32FXXXUsart1_lbdie;
	stm32fxxx_usart1_cr2.lbdl = STM32FXXXUsart1_lbdl;
	stm32fxxx_usart1_cr2.add = STM32FXXXUsart1_add;
	return &stm32fxxx_usart1_cr2;
}
STM32FXXXUSART_CR3* stm32fxxx_usart1_cr3_inic(void)
{

	// CR3
	stm32fxxx_usart1_cr3.onebit = STM32FXXXUsart1_onebit;
	stm32fxxx_usart1_cr3.ctsie = STM32FXXXUsart1_ctsie;
	stm32fxxx_usart1_cr3.ctse = STM32FXXXUsart1_ctse;
	stm32fxxx_usart1_cr3.rtse = STM32FXXXUsart1_rtse;
	stm32fxxx_usart1_cr3.dmat = STM32FXXXUsart1_dmat;
	stm32fxxx_usart1_cr3.dmar = STM32FXXXUsart1_dmar;
	stm32fxxx_usart1_cr3.scen = STM32FXXXUsart1_scen;
	stm32fxxx_usart1_cr3.nack = STM32FXXXUsart1_nack;
	stm32fxxx_usart1_cr3.hdsel = STM32FXXXUsart1_hdsel;
	stm32fxxx_usart1_cr3.irlp = STM32FXXXUsart1_irlp;
	stm32fxxx_usart1_cr3.iren = STM32FXXXUsart1_iren;
	stm32fxxx_usart1_cr3.eie = STM32FXXXUsart1_eie;
	return &stm32fxxx_usart1_cr3;
}
STM32FXXXUSART_GTPR* stm32fxxx_usart1_gtpr_inic(void)
{

	// GTPR
	stm32fxxx_usart1_gtpr.gt = STM32FXXXUsart1_gt;
	stm32fxxx_usart1_gtpr.psc = STM32FXXXUsart1_psc;
	return &stm32fxxx_usart1_gtpr;
}
/*** USART1 INIC Procedure & Function Definition ***/
STM32FXXX_USART1 usart1_enable(void)
{

	// STM32FXXXUSART1obj stm32fxxx_usart1;

	/*** USART1 Bit Mapping Link ***/
	stm32fxxx_usart1.sr = stm32fxxx_usart1_sr_inic();
	stm32fxxx_usart1.dr = STM32FXXXUsart1_dr;
	stm32fxxx_usart1.get_dr = STM32FXXXUsart1_get_dr;
	stm32fxxx_usart1.brr = stm32fxxx_usart1_brr_inic();
	stm32fxxx_usart1.cr1 = stm32fxxx_usart1_cr1_inic();
	stm32fxxx_usart1.cr2 = stm32fxxx_usart1_cr2_inic();
	stm32fxxx_usart1.cr3 = stm32fxxx_usart1_cr3_inic();
	stm32fxxx_usart1.gtpr = stm32fxxx_usart1_gtpr_inic();
	// Other
	stm32fxxx_usart1.clock = STM32FXXXUsart1Clock;
	stm32fxxx_usart1.nvic = STM32FXXXUsart1Nvic;
	stm32fxxx_usart1.parameter = STM32FXXXUsart1Parameter;

	return stm32fxxx_usart1;
}

STM32FXXX_USART1*  usart1(void){ return (STM32FXXX_USART1*) &stm32fxxx_usart1; }

/*** USART2 Auxiliar ***/
STM32FXXXUSART_SR* stm32fxxx_usart2_sr_inic(void)
{

	// SR
	stm32fxxx_usart2_sr.cts = STM32FXXXUsart2_cts;
	stm32fxxx_usart2_sr.clear_cts = STM32FXXXUsart2_clear_cts;
	stm32fxxx_usart2_sr.lbd = STM32FXXXUsart2_lbd;
	stm32fxxx_usart2_sr.clear_lbd = STM32FXXXUsart2_clear_lbd;
	stm32fxxx_usart2_sr.txe = STM32FXXXUsart2_txe;
	stm32fxxx_usart2_sr.tc = STM32FXXXUsart2_tc;
	stm32fxxx_usart2_sr.clear_tc = STM32FXXXUsart2_clear_tc;
	stm32fxxx_usart2_sr.rxne = STM32FXXXUsart2_rxne;
	stm32fxxx_usart2_sr.clear_rxne = STM32FXXXUsart2_clear_rxne;
	stm32fxxx_usart2_sr.idle = STM32FXXXUsart2_idle;
	stm32fxxx_usart2_sr.ore = STM32FXXXUsart2_ore;
	stm32fxxx_usart2_sr.nf = STM32FXXXUsart2_nf;
	stm32fxxx_usart2_sr.fe = STM32FXXXUsart2_fe;
	stm32fxxx_usart2_sr.pe = STM32FXXXUsart2_pe;
	return &stm32fxxx_usart2_sr;
}
STM32FXXXUSART_BRR* stm32fxxx_usart2_brr_inic(void)
{

	// BRR
	stm32fxxx_usart2_brr.div_mantissa = STM32FXXXUsart2_div_mantissa;
	stm32fxxx_usart2_brr.div_fraction = STM32FXXXUsart2_div_fraction;
	return &stm32fxxx_usart2_brr;
}
STM32FXXXUSART_CR1* stm32fxxx_usart2_cr1_inic(void)
{

	// CR1
	stm32fxxx_usart2_cr1.over8 = STM32FXXXUsart2_over8;
	stm32fxxx_usart2_cr1.ue = STM32FXXXUsart2_ue;
	stm32fxxx_usart2_cr1.m = STM32FXXXUsart2_m;
	stm32fxxx_usart2_cr1.wake = STM32FXXXUsart2_wake;
	stm32fxxx_usart2_cr1.pce = STM32FXXXUsart2_pce;
	stm32fxxx_usart2_cr1.ps = STM32FXXXUsart2_ps;
	stm32fxxx_usart2_cr1.peie = STM32FXXXUsart2_peie;
	stm32fxxx_usart2_cr1.txeie = STM32FXXXUsart2_txeie;
	stm32fxxx_usart2_cr1.tcie = STM32FXXXUsart2_tcie;
	stm32fxxx_usart2_cr1.rxneie = STM32FXXXUsart2_rxneie;
	stm32fxxx_usart2_cr1.idleie = STM32FXXXUsart2_idleie;
	stm32fxxx_usart2_cr1.te = STM32FXXXUsart2_te;
	stm32fxxx_usart2_cr1.re = STM32FXXXUsart2_re;
	stm32fxxx_usart2_cr1.rwu = STM32FXXXUsart2_rwu;
	stm32fxxx_usart2_cr1.sbk = STM32FXXXUsart2_sbk;
	return &stm32fxxx_usart2_cr1;
}
STM32FXXXUSART_CR2* stm32fxxx_usart2_cr2_inic(void)
{

	// CR2
	stm32fxxx_usart2_cr2.linen = STM32FXXXUsart2_linen;
	stm32fxxx_usart2_cr2.stop = STM32FXXXUsart2_stop;
	stm32fxxx_usart2_cr2.clken = STM32FXXXUsart2_clken;
	stm32fxxx_usart2_cr2.cpol = STM32FXXXUsart2_cpol;
	stm32fxxx_usart2_cr2.cpha = STM32FXXXUsart2_cpha;
	stm32fxxx_usart2_cr2.lbcl = STM32FXXXUsart2_lbcl;
	stm32fxxx_usart2_cr2.lbdie = STM32FXXXUsart2_lbdie;
	stm32fxxx_usart2_cr2.lbdl = STM32FXXXUsart2_lbdl;
	stm32fxxx_usart2_cr2.add = STM32FXXXUsart2_add;
	return &stm32fxxx_usart2_cr2;
}
STM32FXXXUSART_CR3* stm32fxxx_usart2_cr3_inic(void)
{

	// CR3
	stm32fxxx_usart2_cr3.onebit = STM32FXXXUsart2_onebit;
	stm32fxxx_usart2_cr3.ctsie = STM32FXXXUsart2_ctsie;
	stm32fxxx_usart2_cr3.ctse = STM32FXXXUsart2_ctse;
	stm32fxxx_usart2_cr3.rtse = STM32FXXXUsart2_rtse;
	stm32fxxx_usart2_cr3.dmat = STM32FXXXUsart2_dmat;
	stm32fxxx_usart2_cr3.dmar = STM32FXXXUsart2_dmar;
	stm32fxxx_usart2_cr3.scen = STM32FXXXUsart2_scen;
	stm32fxxx_usart2_cr3.nack = STM32FXXXUsart2_nack;
	stm32fxxx_usart2_cr3.hdsel = STM32FXXXUsart2_hdsel;
	stm32fxxx_usart2_cr3.irlp = STM32FXXXUsart2_irlp;
	stm32fxxx_usart2_cr3.iren = STM32FXXXUsart2_iren;
	stm32fxxx_usart2_cr3.eie = STM32FXXXUsart2_eie;
	return &stm32fxxx_usart2_cr3;
}
STM32FXXXUSART_GTPR* stm32fxxx_usart2_gtpr_inic(void)
{

	// GTPR
	stm32fxxx_usart2_gtpr.gt = STM32FXXXUsart2_gt;
	stm32fxxx_usart2_gtpr.psc = STM32FXXXUsart2_psc;
	return &stm32fxxx_usart2_gtpr;
}
/*** USART2 INIC Procedure & Function Definition ***/
STM32FXXX_USART2 usart2_enable(void)
{


	/*** USART2 Bit Mapping Link ***/
	stm32fxxx_usart2.sr = stm32fxxx_usart2_sr_inic();
	stm32fxxx_usart2.dr = STM32FXXXUsart2_dr;
	stm32fxxx_usart2.get_dr = STM32FXXXUsart2_get_dr;
	stm32fxxx_usart2.brr = stm32fxxx_usart2_brr_inic();
	stm32fxxx_usart2.cr1 = stm32fxxx_usart2_cr1_inic();
	stm32fxxx_usart2.cr2 = stm32fxxx_usart2_cr2_inic();
	stm32fxxx_usart2.cr3 = stm32fxxx_usart2_cr3_inic();
	stm32fxxx_usart2.gtpr = stm32fxxx_usart2_gtpr_inic();
	// Other
	stm32fxxx_usart2.clock = STM32FXXXUsart2Clock;
	stm32fxxx_usart2.nvic = STM32FXXXUsart2Nvic;
	stm32fxxx_usart2.parameter = STM32FXXXUsart2Parameter;
	return stm32fxxx_usart2;
}

