BitNibble/Source_Library/stm32f411lib/Library/Src/stm32fxxxusart.c
STM32FXXX_USART2*  usart2(void){ return (STM32FXXX_USART2*) &stm32fxxx_usart2; }

/*** USART3 Auxiliar ***/
STM32FXXXUSART_SR* stm32fxxx_usart3_sr_inic(void)
{

	// SR
	stm32fxxx_usart3_sr.cts = STM32FXXXUsart3_cts;
	stm32fxxx_usart3_sr.clear_cts = STM32FXXXUsart3_clear_cts;
	stm32fxxx_usart3_sr.lbd = STM32FXXXUsart3_lbd;
	stm32fxxx_usart3_sr.clear_lbd = STM32FXXXUsart3_clear_lbd;
	stm32fxxx_usart3_sr.txe = STM32FXXXUsart3_txe;
	stm32fxxx_usart3_sr.tc = STM32FXXXUsart3_tc;
	stm32fxxx_usart3_sr.clear_tc = STM32FXXXUsart3_clear_tc;
	stm32fxxx_usart3_sr.rxne = STM32FXXXUsart3_rxne;
	stm32fxxx_usart3_sr.clear_rxne = STM32FXXXUsart3_clear_rxne;
	stm32fxxx_usart3_sr.idle = STM32FXXXUsart3_idle;
	stm32fxxx_usart3_sr.ore = STM32FXXXUsart3_ore;
	stm32fxxx_usart3_sr.nf = STM32FXXXUsart3_nf;
	stm32fxxx_usart3_sr.fe = STM32FXXXUsart3_fe;
	stm32fxxx_usart3_sr.pe = STM32FXXXUsart3_pe;
	return &stm32fxxx_usart3_sr;
}
STM32FXXXUSART_BRR* stm32fxxx_usart3_brr_inic(void)
{

	// BRR
	stm32fxxx_usart3_brr.div_mantissa = STM32FXXXUsart3_div_mantissa;
	stm32fxxx_usart3_brr.div_fraction = STM32FXXXUsart3_div_fraction;
	return &stm32fxxx_usart3_brr;
}
STM32FXXXUSART_CR1* stm32fxxx_usart3_cr1_inic(void)
{

	// CR1
	stm32fxxx_usart3_cr1.over8 = STM32FXXXUsart3_over8;
	stm32fxxx_usart3_cr1.ue = STM32FXXXUsart3_ue;
	stm32fxxx_usart3_cr1.m = STM32FXXXUsart3_m;
	stm32fxxx_usart3_cr1.wake = STM32FXXXUsart3_wake;
	stm32fxxx_usart3_cr1.pce = STM32FXXXUsart3_pce;
	stm32fxxx_usart3_cr1.ps = STM32FXXXUsart3_ps;
	stm32fxxx_usart3_cr1.peie = STM32FXXXUsart3_peie;
	stm32fxxx_usart3_cr1.txeie = STM32FXXXUsart3_txeie;
	stm32fxxx_usart3_cr1.tcie = STM32FXXXUsart3_tcie;
	stm32fxxx_usart3_cr1.rxneie = STM32FXXXUsart3_rxneie;
	stm32fxxx_usart3_cr1.idleie = STM32FXXXUsart3_idleie;
	stm32fxxx_usart3_cr1.te = STM32FXXXUsart3_te;
	stm32fxxx_usart3_cr1.re = STM32FXXXUsart3_re;
	stm32fxxx_usart3_cr1.rwu = STM32FXXXUsart3_rwu;
	stm32fxxx_usart3_cr1.sbk = STM32FXXXUsart3_sbk;
	return &stm32fxxx_usart3_cr1;
}
STM32FXXXUSART_CR2* stm32fxxx_usart3_cr2_inic(void)
{

	// CR2
	stm32fxxx_usart3_cr2.linen = STM32FXXXUsart3_linen;
	stm32fxxx_usart3_cr2.stop = STM32FXXXUsart3_stop;
	stm32fxxx_usart3_cr2.clken = STM32FXXXUsart3_clken;
	stm32fxxx_usart3_cr2.cpol = STM32FXXXUsart3_cpol;
	stm32fxxx_usart3_cr2.cpha = STM32FXXXUsart3_cpha;
	stm32fxxx_usart3_cr2.lbcl = STM32FXXXUsart3_lbcl;
	stm32fxxx_usart3_cr2.lbdie = STM32FXXXUsart3_lbdie;
	stm32fxxx_usart3_cr2.lbdl = STM32FXXXUsart3_lbdl;
	stm32fxxx_usart3_cr2.add = STM32FXXXUsart3_add;
	return &stm32fxxx_usart3_cr2;
}
STM32FXXXUSART_CR3* stm32fxxx_usart3_cr3_inic(void)
{

	// CR3
	stm32fxxx_usart3_cr3.onebit = STM32FXXXUsart3_onebit;
	stm32fxxx_usart3_cr3.ctsie = STM32FXXXUsart3_ctsie;
	stm32fxxx_usart3_cr3.ctse = STM32FXXXUsart3_ctse;
	stm32fxxx_usart3_cr3.rtse = STM32FXXXUsart3_rtse;
	stm32fxxx_usart3_cr3.dmat = STM32FXXXUsart3_dmat;
	stm32fxxx_usart3_cr3.dmar = STM32FXXXUsart3_dmar;
	stm32fxxx_usart3_cr3.scen = STM32FXXXUsart3_scen;
	stm32fxxx_usart3_cr3.nack = STM32FXXXUsart3_nack;
	stm32fxxx_usart3_cr3.hdsel = STM32FXXXUsart3_hdsel;
	stm32fxxx_usart3_cr3.irlp = STM32FXXXUsart3_irlp;
	stm32fxxx_usart3_cr3.iren = STM32FXXXUsart3_iren;
	stm32fxxx_usart3_cr3.eie = STM32FXXXUsart3_eie;
	return &stm32fxxx_usart3_cr3;
}
STM32FXXXUSART_GTPR* stm32fxxx_usart3_gtpr_inic(void)
{

	// GTPR
	stm32fxxx_usart3_gtpr.gt = STM32FXXXUsart3_gt;
	stm32fxxx_usart3_gtpr.psc = STM32FXXXUsart3_psc;
	return &stm32fxxx_usart3_gtpr;
}
/*** USART3 INIC Procedure & Function Definition ***/
STM32FXXX_USART3 usart3_enable(void)
{


	/*** USART3 Bit Mapping Link ***/
	stm32fxxx_usart3.sr = stm32fxxx_usart3_sr_inic();
	stm32fxxx_usart3.dr = STM32FXXXUsart3_dr;
	stm32fxxx_usart3.get_dr = STM32FXXXUsart3_get_dr;
	stm32fxxx_usart3.brr = stm32fxxx_usart3_brr_inic();
	stm32fxxx_usart3.cr1 = stm32fxxx_usart3_cr1_inic();
	stm32fxxx_usart3.cr2 = stm32fxxx_usart3_cr2_inic();
	stm32fxxx_usart3.cr3 = stm32fxxx_usart3_cr3_inic();
	stm32fxxx_usart3.gtpr = stm32fxxx_usart3_gtpr_inic();
	// Other
	stm32fxxx_usart3.clock = STM32FXXXUsart3Clock;
	stm32fxxx_usart3.nvic = STM32FXXXUsart3Nvic;
	stm32fxxx_usart3.parameter = STM32FXXXUsart3Parameter;
	return stm32fxxx_usart3;
}

STM32FXXX_USART3*  usart3(void){ return (STM32FXXX_USART3*) &stm32fxxx_usart3; }

/*** UART4 Auxiliar ***/
STM32FXXXUSART_SR* stm32fxxx_uart4_sr_inic(void)
{

	// SR
	stm32fxxx_uart4_sr.cts = STM32FXXXUart4_cts;
	stm32fxxx_uart4_sr.clear_cts = STM32FXXXUart4_clear_cts;
	stm32fxxx_uart4_sr.lbd = STM32FXXXUart4_lbd;
	stm32fxxx_uart4_sr.clear_lbd = STM32FXXXUart4_clear_lbd;
	stm32fxxx_uart4_sr.txe = STM32FXXXUart4_txe;
	stm32fxxx_uart4_sr.tc = STM32FXXXUart4_tc;
	stm32fxxx_uart4_sr.clear_tc = STM32FXXXUart4_clear_tc;
	stm32fxxx_uart4_sr.rxne = STM32FXXXUart4_rxne;
	stm32fxxx_uart4_sr.clear_rxne = STM32FXXXUart4_clear_rxne;
	stm32fxxx_uart4_sr.idle = STM32FXXXUart4_idle;
	stm32fxxx_uart4_sr.ore = STM32FXXXUart4_ore;
	stm32fxxx_uart4_sr.nf = STM32FXXXUart4_nf;
	stm32fxxx_uart4_sr.fe = STM32FXXXUart4_fe;
	stm32fxxx_uart4_sr.pe = STM32FXXXUart4_pe;
	return &stm32fxxx_uart4_sr;
}
STM32FXXXUSART_BRR* stm32fxxx_uart4_brr_inic(void)
{

	// BRR
	stm32fxxx_uart4_brr.div_mantissa = STM32FXXXUart4_div_mantissa;
	stm32fxxx_uart4_brr.div_fraction = STM32FXXXUart4_div_fraction;
	return &stm32fxxx_uart4_brr;
}
STM32FXXXUSART_CR1* stm32fxxx_uart4_cr1_inic(void)
{

	// CR1
	stm32fxxx_uart4_cr1.over8 = STM32FXXXUart4_over8;
	stm32fxxx_uart4_cr1.ue = STM32FXXXUart4_ue;
	stm32fxxx_uart4_cr1.m = STM32FXXXUart4_m;
	stm32fxxx_uart4_cr1.wake = STM32FXXXUart4_wake;
	stm32fxxx_uart4_cr1.pce = STM32FXXXUart4_pce;
	stm32fxxx_uart4_cr1.ps = STM32FXXXUart4_ps;
	stm32fxxx_uart4_cr1.peie = STM32FXXXUart4_peie;
	stm32fxxx_uart4_cr1.txeie = STM32FXXXUart4_txeie;
	stm32fxxx_uart4_cr1.tcie = STM32FXXXUart4_tcie;
	stm32fxxx_uart4_cr1.rxneie = STM32FXXXUart4_rxneie;
	stm32fxxx_uart4_cr1.idleie = STM32FXXXUart4_idleie;
	stm32fxxx_uart4_cr1.te = STM32FXXXUart4_te;
	stm32fxxx_uart4_cr1.re = STM32FXXXUart4_re;
	stm32fxxx_uart4_cr1.rwu = STM32FXXXUart4_rwu;
	stm32fxxx_uart4_cr1.sbk = STM32FXXXUart4_sbk;
	return &stm32fxxx_uart4_cr1;
}
STM32FXXXUSART_CR2* stm32fxxx_uart4_cr2_inic(void)
{

