BitNibble/Source_Library/stm32f411lib/Library/Src/stm32fxxxusart.c
	// CR2
	stm32fxxx_uart4_cr2.linen = STM32FXXXUart4_linen;
	stm32fxxx_uart4_cr2.stop = STM32FXXXUart4_stop;
	stm32fxxx_uart4_cr2.clken = STM32FXXXUart4_clken;
	stm32fxxx_uart4_cr2.cpol = STM32FXXXUart4_cpol;
	stm32fxxx_uart4_cr2.cpha = STM32FXXXUart4_cpha;
	stm32fxxx_uart4_cr2.lbcl = STM32FXXXUart4_lbcl;
	stm32fxxx_uart4_cr2.lbdie = STM32FXXXUart4_lbdie;
	stm32fxxx_uart4_cr2.lbdl = STM32FXXXUart4_lbdl;
	stm32fxxx_uart4_cr2.add = STM32FXXXUart4_add;
	return &stm32fxxx_uart4_cr2;
}
STM32FXXXUSART_CR3* stm32fxxx_uart4_cr3_inic(void)
{

	// CR3
	stm32fxxx_uart4_cr3.onebit = STM32FXXXUart4_onebit;
	stm32fxxx_uart4_cr3.ctsie = STM32FXXXUart4_ctsie;
	stm32fxxx_uart4_cr3.ctse = STM32FXXXUart4_ctse;
	stm32fxxx_uart4_cr3.rtse = STM32FXXXUart4_rtse;
	stm32fxxx_uart4_cr3.dmat = STM32FXXXUart4_dmat;
	stm32fxxx_uart4_cr3.dmar = STM32FXXXUart4_dmar;
	stm32fxxx_uart4_cr3.scen = STM32FXXXUart4_scen;
	stm32fxxx_uart4_cr3.nack = STM32FXXXUart4_nack;
	stm32fxxx_uart4_cr3.hdsel = STM32FXXXUart4_hdsel;
	stm32fxxx_uart4_cr3.irlp = STM32FXXXUart4_irlp;
	stm32fxxx_uart4_cr3.iren = STM32FXXXUart4_iren;
	stm32fxxx_uart4_cr3.eie = STM32FXXXUart4_eie;
	return &stm32fxxx_uart4_cr3;
}
STM32FXXXUSART_GTPR* stm32fxxx_uart4_gtpr_inic(void)
{

	// GTPR
	stm32fxxx_uart4_gtpr.gt = STM32FXXXUart4_gt;
	stm32fxxx_uart4_gtpr.psc = STM32FXXXUart4_psc;
	return &stm32fxxx_uart4_gtpr;
}
/*** UART4 INIC Procedure & Function Definition ***/
STM32FXXX_UART4 uart4_enable(void)
{


	/*** UART4 Bit Mapping Link ***/
	stm32fxxx_uart4.sr = stm32fxxx_uart4_sr_inic();
	stm32fxxx_uart4.dr = STM32FXXXUart4_dr;
	stm32fxxx_uart4.get_dr = STM32FXXXUart4_get_dr;
	stm32fxxx_uart4.brr = stm32fxxx_uart4_brr_inic();
	stm32fxxx_uart4.cr1 = stm32fxxx_uart4_cr1_inic();
	stm32fxxx_uart4.cr2 = stm32fxxx_uart4_cr2_inic();
	stm32fxxx_uart4.cr3 = stm32fxxx_uart4_cr3_inic();
	stm32fxxx_uart4.gtpr = stm32fxxx_uart4_gtpr_inic();
	// Other
	stm32fxxx_uart4.clock = STM32FXXXUart4Clock;
	stm32fxxx_uart4.nvic = STM32FXXXUart4Nvic;
	stm32fxxx_uart4.parameter = STM32FXXXUart4Parameter;
	return stm32fxxx_uart4;
}

STM32FXXX_UART4*  uart4(void){ return (STM32FXXX_UART4*) &stm32fxxx_uart4; }

/*** UART5 Auxiliar ***/
STM32FXXXUSART_SR* stm32fxxx_uart5_sr_inic(void)
{

	// SR
	stm32fxxx_uart5_sr.cts = STM32FXXXUart5_cts;
	stm32fxxx_uart5_sr.clear_cts = STM32FXXXUart5_clear_cts;
	stm32fxxx_uart5_sr.lbd = STM32FXXXUart5_lbd;
	stm32fxxx_uart5_sr.clear_lbd = STM32FXXXUart5_clear_lbd;
	stm32fxxx_uart5_sr.txe = STM32FXXXUart5_txe;
	stm32fxxx_uart5_sr.tc = STM32FXXXUart5_tc;
	stm32fxxx_uart5_sr.clear_tc = STM32FXXXUart5_clear_tc;
	stm32fxxx_uart5_sr.rxne = STM32FXXXUart5_rxne;
	stm32fxxx_uart5_sr.clear_rxne = STM32FXXXUart5_clear_rxne;
	stm32fxxx_uart5_sr.idle = STM32FXXXUart5_idle;
	stm32fxxx_uart5_sr.ore = STM32FXXXUart5_ore;
	stm32fxxx_uart5_sr.nf = STM32FXXXUart5_nf;
	stm32fxxx_uart5_sr.fe = STM32FXXXUart5_fe;
	stm32fxxx_uart5_sr.pe = STM32FXXXUart5_pe;
	return &stm32fxxx_uart5_sr;
}
STM32FXXXUSART_BRR* stm32fxxx_uart5_brr_inic(void)
{

	// BRR
	stm32fxxx_uart5_brr.div_mantissa = STM32FXXXUart5_div_mantissa;
	stm32fxxx_uart5_brr.div_fraction = STM32FXXXUart5_div_fraction;
	return &stm32fxxx_uart5_brr;
}
STM32FXXXUSART_CR1* stm32fxxx_uart5_cr1_inic(void)
{

	// CR1
	stm32fxxx_uart5_cr1.over8 = STM32FXXXUart5_over8;
	stm32fxxx_uart5_cr1.ue = STM32FXXXUart5_ue;
	stm32fxxx_uart5_cr1.m = STM32FXXXUart5_m;
	stm32fxxx_uart5_cr1.wake = STM32FXXXUart5_wake;
	stm32fxxx_uart5_cr1.pce = STM32FXXXUart5_pce;
	stm32fxxx_uart5_cr1.ps = STM32FXXXUart5_ps;
	stm32fxxx_uart5_cr1.peie = STM32FXXXUart5_peie;
	stm32fxxx_uart5_cr1.txeie = STM32FXXXUart5_txeie;
	stm32fxxx_uart5_cr1.tcie = STM32FXXXUart5_tcie;
	stm32fxxx_uart5_cr1.rxneie = STM32FXXXUart5_rxneie;
	stm32fxxx_uart5_cr1.idleie = STM32FXXXUart5_idleie;
	stm32fxxx_uart5_cr1.te = STM32FXXXUart5_te;
	stm32fxxx_uart5_cr1.re = STM32FXXXUart5_re;
	stm32fxxx_uart5_cr1.rwu = STM32FXXXUart5_rwu;
	stm32fxxx_uart5_cr1.sbk = STM32FXXXUart5_sbk;
	return &stm32fxxx_uart5_cr1;
}
STM32FXXXUSART_CR2* stm32fxxx_uart5_cr2_inic(void)
{

	// CR2
	stm32fxxx_uart5_cr2.linen = STM32FXXXUart5_linen;
	stm32fxxx_uart5_cr2.stop = STM32FXXXUart5_stop;
	stm32fxxx_uart5_cr2.clken = STM32FXXXUart5_clken;
	stm32fxxx_uart5_cr2.cpol = STM32FXXXUart5_cpol;
	stm32fxxx_uart5_cr2.cpha = STM32FXXXUart5_cpha;
	stm32fxxx_uart5_cr2.lbcl = STM32FXXXUart5_lbcl;
	stm32fxxx_uart5_cr2.lbdie = STM32FXXXUart5_lbdie;
	stm32fxxx_uart5_cr2.lbdl = STM32FXXXUart5_lbdl;
	stm32fxxx_uart5_cr2.add = STM32FXXXUart5_add;
	return &stm32fxxx_uart5_cr2;
}
STM32FXXXUSART_CR3* stm32fxxx_uart5_cr3_inic(void)
{

	// CR3
	stm32fxxx_uart5_cr3.onebit = STM32FXXXUart5_onebit;
	stm32fxxx_uart5_cr3.ctsie = STM32FXXXUart5_ctsie;
	stm32fxxx_uart5_cr3.ctse = STM32FXXXUart5_ctse;
	stm32fxxx_uart5_cr3.rtse = STM32FXXXUart5_rtse;
	stm32fxxx_uart5_cr3.dmat = STM32FXXXUart5_dmat;
	stm32fxxx_uart5_cr3.dmar = STM32FXXXUart5_dmar;
	stm32fxxx_uart5_cr3.scen = STM32FXXXUart5_scen;
	stm32fxxx_uart5_cr3.nack = STM32FXXXUart5_nack;
	stm32fxxx_uart5_cr3.hdsel = STM32FXXXUart5_hdsel;
	stm32fxxx_uart5_cr3.irlp = STM32FXXXUart5_irlp;
	stm32fxxx_uart5_cr3.iren = STM32FXXXUart5_iren;
	stm32fxxx_uart5_cr3.eie = STM32FXXXUart5_eie;
	return &stm32fxxx_uart5_cr3;
}
STM32FXXXUSART_GTPR* stm32fxxx_uart5_gtpr_inic(void)
{

	// GTPR
	stm32fxxx_uart5_gtpr.gt = STM32FXXXUart5_gt;
	stm32fxxx_uart5_gtpr.psc = STM32FXXXUart5_psc;
	return &stm32fxxx_uart5_gtpr;
}
/*** UART5 INIC Procedure & Function Definition ***/
STM32FXXX_UART5 uart5_enable(void)
{


	/*** UART5 Bit Mapping Link ***/
	stm32fxxx_uart5.sr = stm32fxxx_uart5_sr_inic();
	stm32fxxx_uart5.dr = STM32FXXXUart5_dr;
	stm32fxxx_uart5.get_dr = STM32FXXXUart5_get_dr;
	stm32fxxx_uart5.brr = stm32fxxx_uart5_brr_inic();
	stm32fxxx_uart5.cr1 = stm32fxxx_uart5_cr1_inic();
	stm32fxxx_uart5.cr2 = stm32fxxx_uart5_cr2_inic();
	stm32fxxx_uart5.cr3 = stm32fxxx_uart5_cr3_inic();
	stm32fxxx_uart5.gtpr = stm32fxxx_uart5_gtpr_inic();
	// Other
	stm32fxxx_uart5.clock = STM32FXXXUart5Clock;
	stm32fxxx_uart5.nvic = STM32FXXXUart5Nvic;
	stm32fxxx_uart5.parameter = STM32FXXXUart5Parameter;
	return stm32fxxx_uart5;
}

STM32FXXX_UART5*  uart5(void){ return (STM32FXXX_UART5*) &stm32fxxx_uart5; }

/*** USART6 Auxiliar ***/
STM32FXXXUSART_SR* stm32fxxx_usart6_sr_inic(void)
{

	// SR
	stm32fxxx_usart6_sr.cts = STM32FXXXUsart6_cts;
	stm32fxxx_usart6_sr.clear_cts = STM32FXXXUsart6_clear_cts;
	stm32fxxx_usart6_sr.lbd = STM32FXXXUsart6_lbd;
	stm32fxxx_usart6_sr.clear_lbd = STM32FXXXUsart6_clear_lbd;
	stm32fxxx_usart6_sr.txe = STM32FXXXUsart6_txe;
	stm32fxxx_usart6_sr.tc = STM32FXXXUsart6_tc;
	stm32fxxx_usart6_sr.clear_tc = STM32FXXXUsart6_clear_tc;
	stm32fxxx_usart6_sr.rxne = STM32FXXXUsart6_rxne;
	stm32fxxx_usart6_sr.clear_rxne = STM32FXXXUsart6_clear_rxne;
	stm32fxxx_usart6_sr.idle = STM32FXXXUsart6_idle;
	stm32fxxx_usart6_sr.ore = STM32FXXXUsart6_ore;
	stm32fxxx_usart6_sr.nf = STM32FXXXUsart6_nf;
	stm32fxxx_usart6_sr.fe = STM32FXXXUsart6_fe;
	stm32fxxx_usart6_sr.pe = STM32FXXXUsart6_pe;
	return &stm32fxxx_usart6_sr;
}
STM32FXXXUSART_BRR* stm32fxxx_usart6_brr_inic(void)
{

	// BRR
	stm32fxxx_usart6_brr.div_mantissa = STM32FXXXUsart6_div_mantissa;
	stm32fxxx_usart6_brr.div_fraction = STM32FXXXUsart6_div_fraction;
	return &stm32fxxx_usart6_brr;
}
STM32FXXXUSART_CR1* stm32fxxx_usart6_cr1_inic(void)
{

	// CR1
	stm32fxxx_usart6_cr1.over8 = STM32FXXXUsart6_over8;
	stm32fxxx_usart6_cr1.ue = STM32FXXXUsart6_ue;
	stm32fxxx_usart6_cr1.m = STM32FXXXUsart6_m;
	stm32fxxx_usart6_cr1.wake = STM32FXXXUsart6_wake;
	stm32fxxx_usart6_cr1.pce = STM32FXXXUsart6_pce;
	stm32fxxx_usart6_cr1.ps = STM32FXXXUsart6_ps;
	stm32fxxx_usart6_cr1.peie = STM32FXXXUsart6_peie;
	stm32fxxx_usart6_cr1.txeie = STM32FXXXUsart6_txeie;
	stm32fxxx_usart6_cr1.tcie = STM32FXXXUsart6_tcie;
	stm32fxxx_usart6_cr1.rxneie = STM32FXXXUsart6_rxneie;
	stm32fxxx_usart6_cr1.idleie = STM32FXXXUsart6_idleie;
	stm32fxxx_usart6_cr1.te = STM32FXXXUsart6_te;
	stm32fxxx_usart6_cr1.re = STM32FXXXUsart6_re;
	stm32fxxx_usart6_cr1.rwu = STM32FXXXUsart6_rwu;
	stm32fxxx_usart6_cr1.sbk = STM32FXXXUsart6_sbk;
	return &stm32fxxx_usart6_cr1;
}
STM32FXXXUSART_CR2* stm32fxxx_usart6_cr2_inic(void)
{

