BitNibble/Source_Library/stm32f411lib/Library/Src/stm32fxxxusart.c
	// CR2
	stm32fxxx_usart6_cr2.linen = STM32FXXXUsart6_linen;
	stm32fxxx_usart6_cr2.stop = STM32FXXXUsart6_stop;
	stm32fxxx_usart6_cr2.clken = STM32FXXXUsart6_clken;
	stm32fxxx_usart6_cr2.cpol = STM32FXXXUsart6_cpol;
	stm32fxxx_usart6_cr2.cpha = STM32FXXXUsart6_cpha;
	stm32fxxx_usart6_cr2.lbcl = STM32FXXXUsart6_lbcl;
	stm32fxxx_usart6_cr2.lbdie = STM32FXXXUsart6_lbdie;
	stm32fxxx_usart6_cr2.lbdl = STM32FXXXUsart6_lbdl;
	stm32fxxx_usart6_cr2.add = STM32FXXXUsart6_add;
	return &stm32fxxx_usart6_cr2;
}
STM32FXXXUSART_CR3* stm32fxxx_usart6_cr3_inic(void)
{

	// CR3
	stm32fxxx_usart6_cr3.onebit = STM32FXXXUsart6_onebit;
	stm32fxxx_usart6_cr3.ctsie = STM32FXXXUsart6_ctsie;
	stm32fxxx_usart6_cr3.ctse = STM32FXXXUsart6_ctse;
	stm32fxxx_usart6_cr3.rtse = STM32FXXXUsart6_rtse;
	stm32fxxx_usart6_cr3.dmat = STM32FXXXUsart6_dmat;
	stm32fxxx_usart6_cr3.dmar = STM32FXXXUsart6_dmar;
	stm32fxxx_usart6_cr3.scen = STM32FXXXUsart6_scen;
	stm32fxxx_usart6_cr3.nack = STM32FXXXUsart6_nack;
	stm32fxxx_usart6_cr3.hdsel = STM32FXXXUsart6_hdsel;
	stm32fxxx_usart6_cr3.irlp = STM32FXXXUsart6_irlp;
	stm32fxxx_usart6_cr3.iren = STM32FXXXUsart6_iren;
	stm32fxxx_usart6_cr3.eie = STM32FXXXUsart6_eie;
	return &stm32fxxx_usart6_cr3;
}
STM32FXXXUSART_GTPR* stm32fxxx_usart6_gtpr_inic(void)
{

	// GTPR
	stm32fxxx_usart6_gtpr.gt = STM32FXXXUsart6_gt;
	stm32fxxx_usart6_gtpr.psc = STM32FXXXUsart6_psc;
	return &stm32fxxx_usart6_gtpr;
}
/*** USART6 INIC Procedure & Function Definition ***/
STM32FXXX_USART6 usart6_enable(void)
{


	/*** USART6 Bit Mapping Link ***/
	stm32fxxx_usart6.sr = stm32fxxx_usart6_sr_inic();
	stm32fxxx_usart6.dr = STM32FXXXUsart6_dr;
	stm32fxxx_usart6.get_dr = STM32FXXXUsart6_get_dr;
	stm32fxxx_usart6.brr = stm32fxxx_usart6_brr_inic();
	stm32fxxx_usart6.cr1 = stm32fxxx_usart6_cr1_inic();
	stm32fxxx_usart6.cr2 = stm32fxxx_usart6_cr2_inic();
	stm32fxxx_usart6.cr3 = stm32fxxx_usart6_cr3_inic();
	stm32fxxx_usart6.gtpr = stm32fxxx_usart6_gtpr_inic();
	// Other
	stm32fxxx_usart6.clock = STM32FXXXUsart6Clock;
	stm32fxxx_usart6.nvic = STM32FXXXUsart6Nvic;
	stm32fxxx_usart6.parameter = STM32FXXXUsart6Parameter;
	return stm32fxxx_usart6;
}

STM32FXXX_USART6*  usart6(void){ return (STM32FXXX_USART6*) &stm32fxxx_usart6; }

/*** EOF ***/

